homework/historical/hw6-fall15.tex
% Created 2015-11-10 Tue 15:09
\documentclass{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{khpreamble}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Computerized control - Homework 6}
\author{Kjartan Halvorsen}
\date{Due 2015-11-20}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle



\section{Controller design by state feedback}
\label{sec-1}

  Sampling the DC-motor with transfer function and state-space representation
  \[ G(s) = \frac{1}{s(s+1)} \]
   \begin{align*}
   \dot{x} &= \bbm 0 & 1\\0 & -1\ebm x + \bbm 0\\1\ebm \\
   y &= \bbm 1 & 0\ebm x
   \end{align*}
   gives the discrete-time state-space model
   \begin{align*}
   x(k+1) &= \Phi x(k) + \Gamma u(k) = \bbm \mexp{-h} & 1-\mexp{-h}\\ 0 & 1\ebm x(k) + \bbm \mexp{-h}+h-1\\ h \ebm \\
   y(k) &= Cx(k) = \bbm 1 & 0 \ebm x(k).
   \end{align*}
\subsection{Determine the pulse-transfer function}
\label{sec-1-1}

   Show that the corresponding pulse-transfer operator is given by
  \begin{equation}
  \begin{split}
   H(q) &= \frac{B(q)}{A(q)} = \frac{(q-1)(\mexp{-h}+h-1) + h(1-\mexp{-h})}{(q-1)(q-\mexp{-h})}.
  \end{split}
  \label{eq:Gd}
  \end{equation}
\subsection{Reachability and observability}
\label{sec-1-2}

   Show that the discrete-time system is both reachable and observable.
\subsection{Design the feedback control}
\label{sec-1-3}

   Choose a suitable sampling period $h$ and determine $L$ and $m_0$ in the state feedback
   \[ u(k) = -Lx(k) + m_0u_c(k) \]
   such that the closed loop system has poles in \(0.5\pm i0.5,\) and so that the closed-loop system has static gain equal to 1.
\subsection{Implement the model}
\label{sec-1-4}

   Implement the model in Simulink or in Matlab. Simulate a step-response and attach to your report. Verify that the sampling period is reasonable based on the step-response: Determine the rising time and compare it to the sampling period you chose. 

\end{document}
